public class Asterisks {

    // 6. Необходимо написать программу, которая бы вывела в консоль звездочки
    // вот таким образом, как на картинке ниже.

    public static void main(String[] args) {
        for(int i = 0;i<3;i++) {
            System.out.println("* * * * *");
        }
    }
}
